Did you remember to run the `sql_variables.sh script` before opening up jupyter notebook?  `. ~/Desktop/sql_variables.sh`

In [2]:
import pymysql
import pandas as pd
import os

In [7]:
conn = pymysql.connect(host=os.environ.get('SQLHOSTID'),
                      port=3306,
                      user=os.environ.get('SQLUSERID'),
                      passwd = os.environ.get('SQLPASSWORD'),
                      db='sakila')

In [9]:
df = pd.read_sql('SELECT * FROM actor LIMIT 10', conn)

In [10]:
df.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [11]:
#Close the connection after you get what you want
conn.close()

In [12]:
#Writing to csv
df.to_csv('data/sample.csv', index=False)

In [13]:
#Check that we can read this back into the notebook
df2 = pd.read_csv('data/sample.csv')
df2.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33